swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
/***************************************************************************//**
* \file CapSense_1_SensingCSX_LL.c
* \version 3.0
*
* \brief
*   This file defines the data structure global variables and provides
*   implementation for the low-level APIs of the CSX part of
*   the Sensing module. The file contains the APIs used for the CSD block
*   initialization, calibration and scanning.
*
* \see CapSense_1 v3.0 Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/
#include "syslib/cy_syslib.h"
#include "gpio/cy_gpio.h"

#include "cy_device_headers.h"
#include "cyfitter_gpio.h"
#include "cyfitter_sysint_cfg.h"

#include "CapSense_1_ModClk.h"
#include "CapSense_1_Structure.h"
#include "CapSense_1_Configuration.h"
#include "CapSense_1_SensingCSX_LL.h"
#include "CapSense_1_Sensing.h"
#include "cyapicallbacks.h"

#if (CapSense_1_ENABLE == CapSense_1_CSX_EN)

/*******************************************************************************
* Function constants
*******************************************************************************/

#define  CapSense_1_NUM_HALF_CYCLES                       (2u)


/*******************************************************************************
* Defines module variables
*******************************************************************************/

/* Local variable used to store the Scan period */
volatile uint16 CapSense_1_csxScanPeriod = 0u;
/* Local variable used to return raw count from the post scan ISR */
volatile uint16 CapSense_1_csxRawCount = 0u;
/* Pointer to Flash structure to hold Tx electrode that was connected previously */
static CapSense_1_FLASH_IO_STRUCT const *CapSense_1_curTxIOPtr;
/* Pointer to Flash structure to hold Rx electrode that was connected previously */
static CapSense_1_FLASH_IO_STRUCT const *CapSense_1_curRxIOPtr;
/* Local variable to hold total Tx in widget, while scanning all the sensors in widget */
static uint16 CapSense_1_curWdgtTotalRx = 0u;
/* Local variable to hold total Rx in widget, while scanning all the sensors in widget */
static uint16 CapSense_1_curWdgtTotalTx = 0u;
/* Flag to indicate that electrodes were connected previously */
static uint16 CapSense_1_eleCsxDisconnectFlag = 0u;
/* Pointer to Flash structure holding info of sensor to be scanned */
#if (CapSense_1_ENABLE == CapSense_1_CSX_GANGED_SNS_EN)
    static CapSense_1_FLASH_SNS_STRUCT const *CapSense_1_curGangRxPtr = 0u;
    static CapSense_1_FLASH_SNS_STRUCT const *CapSense_1_curGangTxPtr = 0u;
#endif

/*******************************************************************************
* Module local function declarations
*******************************************************************************/
/**
* \cond SECTION_CYSENSE_INTERNAL
* \addtogroup group_cysense_internal
* \{
*/

static void CapSense_1_SsCSXStartSample(void);
static void CapSense_1_SsCSXPostMultiScan(void);
static void CapSense_1_SsCSXPostSingleScan(void);
static uint16 CapSense_1_SsCalcCsxScanPeriod(CapSense_1_RAM_WD_BASE_STRUCT const *wdgtPtr);

__STATIC_INLINE void CapSense_1_SsCSXStartSampleExt(void);

#if (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
    static uint32 CapSense_1_SsCSXOversample(void);
#endif

#if (CapSense_1_ENABLE == CapSense_1_CSX_GANGED_SNS_EN)
    static void CapSense_1_SsCSXPostMultiScanGanged(void);
#endif

/* Pointer to Pointer to function used to register callback in ISR */
void (*CapSense_1_CSXPostScanApiPtr)(void) = &CapSense_1_SsCSXPostMultiScan;
/** \}
* \endcond */

/*******************************************************************************
* Function Name: CapSense_1_CSXInitialize
****************************************************************************//**
*
* \brief
*   Performs hardware and firmware initialization required for the CSX operation
*   of the CapSense_1 Component.
*
* \details
*   This function initializes hardware to perform the CSX sensing operation. This
*   function is called by the CapSense_1_Start() API during the Component
*   initialization. If both CSX and CSD sensing methods are used in the Component,
*   this function is called by the CapSense_1_SetupWidget() API to change hardware
*   configured for CSD to re-initialize for the CSX sensing.
*
*   If the CSD and CSX widgets are used in the Component, it is recommended not to
*   mix the CSD widgets between the CSX widgets, instead, place all CSX widgets in
*   the required scanning order and then place the CSD widgets in the customizer.
*   For the Component API, this action will eliminate the need for changing the hardware
*   configuration for every widget scan and will increase the execution speed
*   in the CapSense_1_ScanAllWidgets() when the API is called.
*
*   Similarly, it is recommended to set up and scan all the CSX widgets in such
*   a sequence that the CapSense_1_SetupWidget() API  shouldn't need
*   hardware  sensing-configuration change.
*
*   It is highly not recommended to call this API directly from the application layer.
*
*******************************************************************************/
void CapSense_1_CSXInitialize(void)
{
    uint32 interruptState;
    uint32 tmpRegVal;

    CapSense_1_BistDischargeExtCapacitors();

    Cy_GPIO_SetDrivemode(CapSense_1_CintA_0_PORT, CapSense_1_CintA_0_NUM, CapSense_1_CintA_0_DRIVEMODE);
    Cy_GPIO_SetDrivemode(CapSense_1_CintB_0_PORT, CapSense_1_CintB_0_NUM, CapSense_1_CintB_0_DRIVEMODE);

    /* Clear all pending interrupts of CSD block */
    CY_SET_REG32(CapSense_1_CSD_INTR_PTR,             CapSense_1_CSD_INTR_ALL_MSK);
    CY_SET_REG32(CapSense_1_CSD_INTR_SET_PTR,         CapSense_1_DEFAULT_CSD_INTR_SET_CFG);
    CY_SET_REG32(CapSense_1_CSD_INTR_MASK_PTR,        CapSense_1_DEFAULT_CSD_INTR_MASK_CFG);
    CY_SET_REG32(CapSense_1_CSD_HSCMP_PTR,            CapSense_1_DEFAULT_CSD_HSCMP_CFG);
    CY_SET_REG32(CapSense_1_CSD_AMBUF_PTR,            CapSense_1_DEFAULT_CSD_AMBUF_CFG);
    CY_SET_REG32(CapSense_1_CSD_REFGEN_PTR,           CapSense_1_DEFAULT_CSD_REFGEN_CFG);
    CY_SET_REG32(CapSense_1_CSD_CSDCMP_PTR,           CapSense_1_DEFAULT_CSD_CSDCMP_CFG);
    CY_SET_REG32(CapSense_1_CSD_IDACA_PTR,            CapSense_1_DEFAULT_CSD_IDACA_CFG);

    #if((CapSense_1_ENABLE == CapSense_1_ADC_EN) || (CapSense_1_ENABLE == CapSense_1_IDACB_USED))
        CY_SET_REG32(CapSense_1_CSD_IDACB_PTR,    CapSense_1_DEFAULT_CSD_IDACB_CFG);
    #endif /* (0u != CapSense_1_ADC_EN) || (0u != CapSense_1_IDACB_USED) */

    CY_SET_REG32(CapSense_1_CSD_SW_RES_PTR,           CapSense_1_DEFAULT_CSD_SW_RES_CFG);
    CY_SET_REG32(CapSense_1_CSD_SENSE_PERIOD_PTR,     CapSense_1_DEFAULT_CSD_SENSE_PERIOD_CFG);
    CY_SET_REG32(CapSense_1_CSD_SENSE_DUTY_PTR,       CapSense_1_DEFAULT_CSD_SENSE_DUTY_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_HS_P_SEL_PTR,      CapSense_1_DEFAULT_CSD_SW_HS_P_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_HS_N_SEL_PTR,      CapSense_1_DEFAULT_CSD_SW_HS_N_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_SHIELD_SEL_PTR,    CapSense_1_DEFAULT_CSD_SW_SHIELD_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_AMUXBUF_SEL_PTR,   CapSense_1_DEFAULT_CSD_SW_AMUXBUF_SEL_CFG);

