swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
    interruptState = Cy_SysLib_EnterCriticalSection();
    tmpRegVal = CY_GET_REG32(CapSense_1_CSD_SW_BYP_SEL_PTR);
    tmpRegVal &= ~(CapSense_1_CSD_SW_BYP_SEL_SW_BYA_MSK);
    tmpRegVal |= CapSense_1_DEFAULT_CSD_SW_BYP_SEL_CFG;
    CY_SET_REG32(CapSense_1_CSD_SW_BYP_SEL_PTR,       tmpRegVal);
    Cy_SysLib_ExitCriticalSection(interruptState);

    CY_SET_REG32(CapSense_1_CSD_SW_CMP_P_SEL_PTR,     CapSense_1_DEFAULT_CSD_SW_CMP_P_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_CMP_N_SEL_PTR,     CapSense_1_DEFAULT_CSD_SW_CMP_N_SEL_CFG);

    interruptState = Cy_SysLib_EnterCriticalSection();
    tmpRegVal = CY_GET_REG32(CapSense_1_CSD_SW_REFGEN_SEL_PTR);
    tmpRegVal &= ~CapSense_1_DEFAULT_CSD_SW_REFGEN_SEL_MSK;
    tmpRegVal |= CapSense_1_DEFAULT_CSD_SW_REFGEN_SEL_CFG;
    CY_SET_REG32(CapSense_1_CSD_SW_REFGEN_SEL_PTR,    tmpRegVal);
    Cy_SysLib_ExitCriticalSection(interruptState);

    CY_SET_REG32(CapSense_1_CSD_SW_FW_MOD_SEL_PTR,    CapSense_1_DEFAULT_CSD_SW_FW_MOD_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_FW_TANK_SEL_PTR,   CapSense_1_DEFAULT_CSD_SW_FW_TANK_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_DSI_SEL_PTR,       CapSense_1_DEFAULT_CSD_SW_DSI_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_IO_SEL_PTR,           CapSense_1_DEFAULT_CSD_SW_IO_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SEQ_TIME_PTR,         CapSense_1_DEFAULT_CSD_SEQ_TIME_CFG);
    CY_SET_REG32(CapSense_1_CSD_SEQ_INIT_CNT_PTR,     CapSense_1_DEFAULT_CSD_SEQ_INIT_CNT_CFG);
    CY_SET_REG32(CapSense_1_CSD_SEQ_NORM_CNT_PTR,     CapSense_1_DEFAULT_CSD_SEQ_NORM_CNT_CFG);
    CY_SET_REG32(CapSense_1_CSD_ADC_CTL_PTR,          CapSense_1_DEFAULT_CSD_ADC_CTL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SEQ_START_PTR,        CapSense_1_DEFAULT_CSD_SEQ_START_CFG);
    CY_SET_REG32(CapSense_1_CSD_CONFIG_PTR,           CapSense_1_DEFAULT_CSD_CONFIG_CFG);

    CapSense_1_ModClk_SetDivider((uint32)CapSense_1_dsRam.modCsxClk - 1uL);

    #if (CapSense_1_ENABLE == CapSense_1_CSX_COMMON_TX_CLK_EN)
        CapSense_1_SsSetSnsClockDivider((uint32)CapSense_1_dsRam.snsCsxClk);
    #endif

    /* Set all IO states to default state */
    CapSense_1_SsSetIOsInDefaultState();

    /* Enable CSD block interrupt and set interrupt vector to CSX sensing method */
    CapSense_1_SsIsrInitialize(&CapSense_1_CSXScanISR);
}


/*******************************************************************************
* Function Name: CapSense_1_CSXElectrodeCheck
****************************************************************************//**
*
* \brief
*   Check if electrodes were previously connected using
*   the CapSense_1_CSXSetupWidgetExt() API and if yes, disconnect them.
*
* \details
*   This function checks if CapSense_1_eleCsxDisconnectFlag is set.
*   If it is set, the function disconnects the previously connected electrode.
*
*******************************************************************************/
void CapSense_1_CSXElectrodeCheck(void)
{
    #if (CapSense_1_ENABLE == CapSense_1_CSX_GANGED_SNS_EN)
        uint32 numElectrodes;
    #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_GANGED_SNS_EN) */

    if (0u != CapSense_1_eleCsxDisconnectFlag)
    {
       /* Disconnect if electrodes were previous connected by SetupWidgetExt() API */
        #if (CapSense_1_ENABLE == CapSense_1_CSX_GANGED_SNS_EN)
            /* Check ganged sns flag */
            if (CapSense_1_GANGED_SNS_MASK == (CapSense_1_curFlashWdgtPtr->staticConfig & CapSense_1_GANGED_SNS_MASK))
            {
                /* 1. Get number of pins in previous connected Tx electrode
                    3. Get Tx pointer
                    4. Disconnect all Tx */
                numElectrodes = CapSense_1_curGangTxPtr->numPins;
                CapSense_1_curTxIOPtr = &CapSense_1_ioList[CapSense_1_curGangTxPtr->firstPinId];

                do
                {
                    CapSense_1_CSXDisconnectTx(CapSense_1_curTxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);

                /* 1. Get number of pins in previous connected Rx electrode
                    3. Get Rx pointer
                    4. Disconnect all Rx */
                numElectrodes = CapSense_1_curGangRxPtr->numPins;
                CapSense_1_curRxIOPtr = &CapSense_1_ioList[CapSense_1_curGangRxPtr->firstPinId];

                do
                {
                    CapSense_1_CSXDisconnectRx(CapSense_1_curRxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);
            }
            else
            {
                /* Disconnect if electrodes were previous connected by SetupWidgetExt API */
                CapSense_1_CSXDisconnectTx(CapSense_1_curTxIOPtr);
                CapSense_1_CSXDisconnectRx(CapSense_1_curRxIOPtr);
            }
        #else
            /* Disconnect if electrodes were previous connected by SetupWidgetExt API */
            CapSense_1_CSXDisconnectTx(CapSense_1_curTxIOPtr);
            CapSense_1_CSXDisconnectRx(CapSense_1_curRxIOPtr);
        #endif
        CapSense_1_eleCsxDisconnectFlag = 0u;
    }
}


/*******************************************************************************
* Function Name: CapSense_1_CSXSetupWidget
****************************************************************************//**
*
* \brief
*  Performs hardware and firmware initialization required for scanning sensors
*  in a specific widget using the CSX sensing method. This function requires
*  using the CapSense_1_CSXScan() function to start scanning.
*
* \details
*  This function initializes the widgets specific common parameters to perform
*  the CSX scanning. The initialization includes the following:
*    1. The CSD_CONFIG register.
*    2. The IDAC register.
*    3. The Sense clock frequency
*    4. The phase alignment of the sense and modulator clocks.
*
*  This function does not connect any specific sensors to the scanning hardware
*  and neither does it start a scanning process. The CapSense_1_CSXScan()
*  function must be called after initializing the widget to start scanning.
*
*  This function is called when no scanning is in progress. I.e.
*  CapSense_1_IsBusy() returns a non-busy status.
*
*  This function is called by the CapSense_1_SetupWidget() API if the
*  given widget uses the CSX sensing method.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time or pipeline scanning for example).
*
* \param widgetId
*  Specifies the ID number of the widget to perform hardware and firmware
*  initialization required for scanning sensors in the specific widget.
*  A macro for the widget ID can be found in the CapSense_1 Configuration header
*  file defined as CapSense_1_<WidgetName>_WDGT_ID.
*
*******************************************************************************/
void CapSense_1_CSXSetupWidget(uint32 widgetId)
{
    /* variable to access widget details */
    CapSense_1_RAM_WD_BASE_STRUCT * curRamWdgtBasePtr;

    uint32 tmpRegVal;
    uint32 snsClkVal;

    /* Save the current widget Id */
    CapSense_1_widgetIndex = (uint8)widgetId;


    #if ((CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) || \
        (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN) || \
        (CapSense_1_ENABLE == CapSense_1_ADC_EN))
         CapSense_1_SsSwitchSensingMode(CapSense_1_SENSE_METHOD_CSX_E);
    #endif /* ((CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) || \
               (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN) || \
               (CapSense_1_ENABLE == CapSense_1_ADC_EN)) */

