swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
    /*
    *  Check if CSX electrodes were previously connected using
    *  CapSense_1_CSXSetupWidgetExt API and if yes, disconnect them
    */
    CapSense_1_CSXElectrodeCheck();

    /* Configure hardware block */
    CapSense_1_curFlashWdgtPtr = &CapSense_1_dsFlash.wdgtArray[widgetId];

    curRamWdgtBasePtr = (CapSense_1_RAM_WD_BASE_STRUCT *)CapSense_1_curFlashWdgtPtr->ptr2WdgtRam;

    #if (CapSense_1_ENABLE == CapSense_1_CSX_COMMON_TX_CLK_EN)
        snsClkVal = (uint32)CapSense_1_dsRam.snsCsxClk;
    #else
        snsClkVal = (uint32)curRamWdgtBasePtr->snsClk;
    #endif /* (CapSense_1_ENABLE  == CapSense_1_CSX_COMMON_TX_CLK_EN) */

    CY_SET_REG32(CapSense_1_CSD_SEQ_NORM_CNT_PTR, (uint32)curRamWdgtBasePtr->resolution);
    CapSense_1_csxScanPeriod  = CapSense_1_SsCalcCsxScanPeriod(curRamWdgtBasePtr);

    tmpRegVal = (uint32)curRamWdgtBasePtr->snsClkSource;

    snsClkVal = (snsClkVal - 1uL) & CapSense_1_CSD_SENSE_PERIOD_SENSE_DIV_MSK;
    tmpRegVal = (tmpRegVal << CapSense_1_CSD_SENSE_PERIOD_LFSR_SIZE_POS) | snsClkVal |
        CapSense_1_CSD_SENSE_PERIOD_LFSR_BITS_MSK;
    CY_SET_REG32(CapSense_1_CSD_SENSE_PERIOD_PTR, tmpRegVal);
    CapSense_1_ModClk_SetDivider((uint32)CapSense_1_dsRam.modCsxClk - 1uL);

}

/*******************************************************************************
* Function Name: CapSense_1_CSXSetupWidgetExt
****************************************************************************//**
*
* \brief
*  Performs extended initialization for the CSX widget and also performs
*  initialization required for a specific sensor in the widget. This function
*  requires using the CapSense_1_CSXScan() function to initiate a scan.
*
* \details
*  This function does the same tasks as CapSense_1_CSXSetupWidget() and
*  also connects a sensor in the widget for scanning. Once this function is
*  called to initialize a widget and a sensor, the CapSense_1_CSXScanExt()
*  function must be called to scan the sensor.
*
*  This function is called when no scanning is in progress. I.e.
*  CapSense_1_IsBusy() returns a non-busy status.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time or pipeline scanning for example).
*
* \param widgetId
*  Specifies the ID number of the widget to perform hardware and firmware
*  initialization required for scanning a specific sensor in a specific widget.
*  A macro for the widget ID can be found in the CapSense_1 Configuration header
*  file defined as CapSense_1_<WidgetName>_WDGT_ID.
*
* \param sensorId
*  Specifies the ID number of the sensor within the widget to perform hardware
*  and firmware initialization required for scanning a specific sensor in a
*  specific widget.
*  A macro for the sensor ID within a specified widget can be found in the
*  CapSense_1 Configuration header file defined as
*  CapSense_1_<WidgetName>_SNS<SensorNumber>_ID.
*
*******************************************************************************/

void CapSense_1_CSXSetupWidgetExt(uint32 widgetId, uint32 sensorId)
{
    uint32 txIndex;
    uint32 rxIndex;

    #if (CapSense_1_ENABLE == CapSense_1_CSX_GANGED_SNS_EN)
        uint16 numElectrodes;
    #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_GANGED_SNS_EN) */

    /* Initialize widget */
    CapSense_1_CSXSetupWidget(widgetId);
    CapSense_1_sensorIndex = (uint8)sensorId;

    /* initialize sensor data structure pointer to appropriate address */
    CapSense_1_curRamSnsPtr = CapSense_1_curFlashWdgtPtr->ptr2SnsRam;
    CapSense_1_curRamSnsPtr = &CapSense_1_curRamSnsPtr[sensorId];

    #if (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        if (0u != CapSense_1_curRamSnsPtr->subConvNum)
        {
    #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

    /*
    *  Find Tx and Rx index for given snsIndex
    *    rxIndex = sensorId / TxCount
    *    txIndex = sensorId % TxCount
    */
    rxIndex = sensorId /CapSense_1_curFlashWdgtPtr->numRows;
    txIndex = sensorId % CapSense_1_curFlashWdgtPtr->numRows;

    /* If widget is APA, find node (Tx/Rx) to be connected for scanning */
    #if (CapSense_1_ENABLE == CapSense_1_CSX_GANGED_SNS_EN)
        if (CapSense_1_GANGED_SNS_MASK == (CapSense_1_curFlashWdgtPtr->staticConfig & CapSense_1_GANGED_SNS_MASK))
        {
            /*
            *  1. Get access to Rx sensor pointer (Rx = Base + rxIndex).
            *  2. Get number of Rx electrodes
            *  3. Get Rx pointer
            *  4. Connect all Rx
            */
            CapSense_1_curGangRxPtr = CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
            CapSense_1_curGangRxPtr += rxIndex;
            numElectrodes = CapSense_1_curGangRxPtr->numPins;
            CapSense_1_curRxIOPtr = &CapSense_1_ioList[CapSense_1_curGangRxPtr->firstPinId];

            do
            {
                CapSense_1_CSXConnectRx(CapSense_1_curRxIOPtr++);
                numElectrodes--;
            } while (0u != numElectrodes);

            /*
            *  1. Get access to Tx sensor pointer (Tx = Base + NumberRx + TxIndex).
            *  2. Get number of Tx electrodes
            *  3. Get Tx pointer
            *  4. Connect all Tx
            */
            CapSense_1_curGangTxPtr = CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
            CapSense_1_curGangTxPtr += (CapSense_1_curFlashWdgtPtr->numCols + txIndex);

            numElectrodes = CapSense_1_curGangTxPtr->numPins;
            CapSense_1_curTxIOPtr = &CapSense_1_ioList[CapSense_1_curGangTxPtr->firstPinId];

            do
            {
                CapSense_1_CSXConnectTx(CapSense_1_curTxIOPtr++);
                numElectrodes--;
            }while (0u != numElectrodes);

            /* Set callback to scan connected ganged sensor only */
            CapSense_1_CSXPostScanApiPtr = &CapSense_1_SsCSXPostSingleScan;
        }
        else
    #endif  /* (CapSense_1_ENABLE == CapSense_1_CSD_CSX_EN) */
        {
            /*
            *  If no ganged sensor in Component OR current widget no contains ganged sns, then:
            *    1. Find Rx pointer: Rx = Base address + RxIndex
            *    2. Find Tx pointer: Tx = Base address + (total Rx + TxIndex)
            */
            CapSense_1_curRxIOPtr = (CapSense_1_FLASH_IO_STRUCT const *)CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
            CapSense_1_curRxIOPtr = &CapSense_1_curRxIOPtr[rxIndex];

            CapSense_1_curTxIOPtr = (CapSense_1_FLASH_IO_STRUCT const *)CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
            CapSense_1_curTxIOPtr = &CapSense_1_curTxIOPtr[(CapSense_1_curFlashWdgtPtr->numCols + txIndex)];

