swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
            /* Connect Tx and Rx IOs for scan ad set flag to indicate that IOs should be disconnected */
            CapSense_1_CSXConnectTx(CapSense_1_curTxIOPtr);
            CapSense_1_CSXConnectRx(CapSense_1_curRxIOPtr);
            CapSense_1_eleCsxDisconnectFlag = CapSense_1_DISCONNECT_IO_FLAG;

            /* Set callback to scan all the sensors in widget */
            CapSense_1_CSXPostScanApiPtr = &CapSense_1_SsCSXPostSingleScan;
        }
    #if (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        }
    #endif
}

/*******************************************************************************
* Function Name: CapSense_1_CSXScan
****************************************************************************//**
*
* \brief
*  This function initiates a scan for the sensors of the widget initialized by
*  the CapSense_1_CSXSetupWidget() function.
*
* \details
*  This function performs scanning of all the sensors in the widget configured by
*  the CapSense_1_CSXSetupWidget() function. It does the following tasks:
*    1. Connects the first sensor of the widget.
*    2. Initializes an interrupt callback function to initialize a scan of the
*       next sensors in a widget.
*    3. Starts scanning for the first sensor in the widget.
*
*  This function is called by the CapSense_1_Scan() API if the given
*  widget uses the CSX sensing method.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time or pipeline scanning for example).
*
*  This function is called when no scanning is in progress. I.e.
*  CapSense_1_IsBusy() returns a non-busy status. The widget must be
*  preconfigured by the CapSense_1_CSXSetupWidget() function if any other
*  widget was previously scanned or any other type of scan functions were used.
*
*******************************************************************************/

void CapSense_1_CSXScan(void)
{
    #if (CapSense_1_ENABLE == CapSense_1_CSX_GANGED_SNS_EN)
        uint32 numElectrodes;
    #endif
    #if (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        uint32 snsIndex = 0u;
        uint32 snsNum;
    #endif

    CapSense_1_sensorIndex = 0u;

    /* initialize pointer to access sensor RAM elements */
    CapSense_1_curRamSnsPtr = CapSense_1_curFlashWdgtPtr->ptr2SnsRam;

    #if (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        /* Loop through the sensors until non-skipped is found */
        snsNum = CapSense_1_curFlashWdgtPtr->totalNumSns;
        while ((snsIndex < snsNum) && (CapSense_1_curRamSnsPtr->subConvNum == 0u))
        {
            /* Increment sensor pointers */
            CapSense_1_curRamSnsPtr++;
            CapSense_1_sensorIndex++;
            snsIndex++;
        }
        /*
        *  Calculate total sensor to be scanned. If buttons, one Tx and an Rx for each sensor
        *  if Matrix button or Touchpad, M x N rule applies
        */
        CapSense_1_curWdgtTotalTx = (uint16)(CapSense_1_curFlashWdgtPtr->numRows - (snsIndex % CapSense_1_curFlashWdgtPtr->numRows));
        CapSense_1_curWdgtTotalRx  = (uint16)(CapSense_1_curFlashWdgtPtr->numCols - (snsIndex / CapSense_1_curFlashWdgtPtr->numRows));

        /* Scan sensor if it's index within a valid range otherwise do nothing as all the sensors are skipped */
        if (snsIndex < snsNum)
        {
            #if (CapSense_1_ENABLE == CapSense_1_CSX_GANGED_SNS_EN)
                if ((CapSense_1_curFlashWdgtPtr->staticConfig & CapSense_1_GANGED_SNS_MASK) != 0u)
                {
                    /* Connect all Rx electrodes */
                    CapSense_1_curGangRxPtr = CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
                    CapSense_1_curGangRxPtr += snsIndex /CapSense_1_curFlashWdgtPtr->numRows;
                    numElectrodes = CapSense_1_curGangRxPtr->numPins;
                    CapSense_1_curRxIOPtr = &CapSense_1_ioList[CapSense_1_curGangRxPtr->firstPinId];
                    do
                    {
                        CapSense_1_CSXConnectRx(CapSense_1_curRxIOPtr++);
                        numElectrodes--;
                    } while (0u != numElectrodes);

                    /* Connect all Tx electrodes */
                    CapSense_1_curGangTxPtr = CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
                    CapSense_1_curGangTxPtr += (CapSense_1_curFlashWdgtPtr->numCols + snsIndex % CapSense_1_curFlashWdgtPtr->numRows);
                    numElectrodes = CapSense_1_curGangTxPtr->numPins;
                    CapSense_1_curTxIOPtr = &CapSense_1_ioList[CapSense_1_curGangTxPtr->firstPinId];
                    do
                    {
                        CapSense_1_CSXConnectTx(CapSense_1_curTxIOPtr++);
                        numElectrodes--;
                    }while (0u != numElectrodes);
                    /* Assign callback to ISR */
                    CapSense_1_CSXPostScanApiPtr = &CapSense_1_SsCSXPostMultiScanGanged;
                }
                else
            #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_GANGED_SNS_EN) */
            {
                /* Find Rx pointer: Rx = Base_address + SnsIndex / total_Tx */
                CapSense_1_curRxIOPtr = (CapSense_1_FLASH_IO_STRUCT const *)CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
                CapSense_1_curRxIOPtr += (snsIndex / CapSense_1_curFlashWdgtPtr->numRows);
                /* Find Tx pointer: Tx = Base_address + total_Rx + SnsIndex % total_Tx */
                CapSense_1_curTxIOPtr = (CapSense_1_FLASH_IO_STRUCT const *)CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
                CapSense_1_curTxIOPtr += CapSense_1_curFlashWdgtPtr->numCols;
                CapSense_1_curTxIOPtr += (snsIndex % CapSense_1_curFlashWdgtPtr->numRows);
                /* Connect Tx and Rx electrodes for scan */
                CapSense_1_CSXConnectTx(CapSense_1_curTxIOPtr);
                CapSense_1_CSXConnectRx(CapSense_1_curRxIOPtr);
                /* Set callback to scan all the sensors in widget */
                CapSense_1_CSXPostScanApiPtr = &CapSense_1_SsCSXPostMultiScan;
            }

            /* Reset multi-frequency scan channel if enabled */
            #if (CapSense_1_MULTI_FREQ_SCAN_EN == CapSense_1_ENABLE)
                CapSense_1_scanFreqIndex = CapSense_1_FREQ_CHANNEL_0;
            #endif

            /* Set scan status, enter critical section and initiate scan */
            CapSense_1_SetBusyFlags(CapSense_1_SW_STS_BUSY);

            #if (CapSense_1_ENABLE != CapSense_1_BLOCK_OFF_AFTER_SCAN_EN)
                #if(CapSense_1_CSX_ANALOG_STARTUP_DELAY_US > 0uL)
                    Cy_SysLib_DelayUs(CapSense_1_CSX_ANALOG_STARTUP_DELAY_US);
                #endif /* (CapSense_1_CSX_ANALOG_STARTUP_DELAY_US > 0uL) */
            #endif /* (CapSense_1_ENABLE != CapSense_1_BLOCK_OFF_AFTER_SCAN_EN) */
            CapSense_1_SsCSXStartSample();
        }

    #else /* (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

