swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
        /*
        *  Calculate total sensor to be scanned. If buttons, one Tx and an Rx for each sensor
        *  if Matrix button or Touchpad, M x N rule applies
        */
        CapSense_1_curWdgtTotalTx = CapSense_1_curFlashWdgtPtr->numRows;
        CapSense_1_curWdgtTotalRx  = CapSense_1_curFlashWdgtPtr->numCols;

        /* If Component contains CSX ganged sensor, then check if widget contains ganged sensor */
        #if (CapSense_1_CSX_GANGED_SNS_EN == 1u)
            if ((CapSense_1_curFlashWdgtPtr->staticConfig & CapSense_1_GANGED_SNS_MASK) != 0u)
            {
                /*
                *  1. Get sns pointer for first Rx
                *  2. Get number of Rx pin
                *  3. Get pointer to the Rx pin
                *  4. Connect all Rx pins
                */
                CapSense_1_curGangRxPtr = CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
                numElectrodes = CapSense_1_curGangRxPtr->numPins ;
                CapSense_1_curRxIOPtr = &CapSense_1_ioList[CapSense_1_curGangRxPtr->firstPinId];
                do
                {
                    CapSense_1_CSXConnectRx(CapSense_1_curRxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);

                /*
                *  1. Get sns pointer for first Tx (Tx = Base + number of Rx).
                *  2. Get number of Tx electrodes
                *  3. Get pointer the Tx electrode
                *  4. Connect all Tx
                */
                CapSense_1_curGangTxPtr = CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
                CapSense_1_curGangTxPtr += CapSense_1_curFlashWdgtPtr->numCols;
                numElectrodes = CapSense_1_curGangTxPtr->numPins ;
                CapSense_1_curTxIOPtr = &CapSense_1_ioList[CapSense_1_curGangTxPtr->firstPinId];

                do
                {
                    CapSense_1_CSXConnectTx(CapSense_1_curTxIOPtr++);
                    numElectrodes--;
                }while (0u != numElectrodes);

                /* Assign callback to ISR */
                CapSense_1_CSXPostScanApiPtr = &CapSense_1_SsCSXPostMultiScanGanged;

            }
            else
        #endif
            {
                /*
                *  If no ganged sensor in the Component OR current widget contains no ganged sns, then:
                *    1. Find Rx pointer: Rx = Base address.
                *    2. Find Tx pointer: Tx = Base address + total Rx
                */
                CapSense_1_curRxIOPtr = (CapSense_1_FLASH_IO_STRUCT const *)CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
                CapSense_1_curTxIOPtr = CapSense_1_curRxIOPtr;
                CapSense_1_curTxIOPtr = &CapSense_1_curTxIOPtr[(CapSense_1_curFlashWdgtPtr->numCols)];

                /* Connect first Tx and first Rx IOs for scan */
                CapSense_1_CSXConnectTx(CapSense_1_curTxIOPtr);
                CapSense_1_CSXConnectRx(CapSense_1_curRxIOPtr);

                /* Set callback to scan all the sensors in widget */
                CapSense_1_CSXPostScanApiPtr = &CapSense_1_SsCSXPostMultiScan;
            }

            /* Reset multi-frequency scan channel if enabled */
            #if (CapSense_1_MULTI_FREQ_SCAN_EN == CapSense_1_ENABLE)
                CapSense_1_scanFreqIndex = CapSense_1_FREQ_CHANNEL_0;
            #endif

        /* Set scan status, enter critical section and initiate scan */
        CapSense_1_SetBusyFlags(CapSense_1_SW_STS_BUSY);

        #if (CapSense_1_ENABLE != CapSense_1_BLOCK_OFF_AFTER_SCAN_EN)
            #if(CapSense_1_CSX_ANALOG_STARTUP_DELAY_US > 0uL)
                Cy_SysLib_DelayUs(CapSense_1_CSX_ANALOG_STARTUP_DELAY_US);
            #endif /* (CapSense_1_CSX_ANALOG_STARTUP_DELAY_US > 0uL) */
        #endif /* (CapSense_1_ENABLE != CapSense_1_BLOCK_OFF_AFTER_SCAN_EN) */
        CapSense_1_SsCSXStartSample();

    #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */
}

/*******************************************************************************
* Function Name: CapSense_1_CSXScanExt()
****************************************************************************//**
*
* \brief
*  Starts the CSX conversion on the preconfigured sensor. This function requires
*  using the CapSense_1_CSXSetupWidgetExt() function to set up a
*  widget.
*
* \details
*  This function performs single scanning of one sensor in the widget configured
*  by the CapSense_1_CSXSetupWidgetExt() function. It does the following
*  tasks:
*    1. Sets a busy flag in the CapSense_1_dsRam structure.
*    2. Configures the Tx clock frequency.
*    3. Configures the Modulator clock frequency.
*    4. Configures the IDAC value.
*    5. Starts single scanning.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time or pipeline scanning for example). This
*  function is called when no scanning is in progress. I.e.
*  CapSense_1_IsBusy() returns a non-busy status.
*
*  The sensor must be preconfigured by using the
*  CapSense_1_CSXSetupWidgetExt() API prior to calling this function.
*  The sensor remains ready for the next scan if a previous scan was triggered
*  by using the CapSense_1_CSXScanExt() function. In this case, calling
*  CapSense_1_CSXSetupWidgetExt() is not required every time before the
*  CapSense_1_CSXScanExt() function. If a previous scan was triggered in
*  any other way - CapSense_1_Scan(), CapSense_1_ScanAllWidgets()
*  or CapSense_1_RunTuner() - (see the CapSense_1_RunTuner() function
*  description for more details), the sensor must be preconfigured again by
*  using the CapSense_1_CSXSetupWidgetExt() API prior to calling the
*  CapSense_1_CSXScanExt() function.
*
*  If disconnection of the sensors is required after calling
*  CapSense_1_CSXScanExt(), the CapSense_1_CSXDisconnectTx() and
*  CapSense_1_CSXDisconnectRx() APIs can be used.
*
*******************************************************************************/

void CapSense_1_CSXScanExt(void)
{
    /* Reset multi-frequency scan channel if enabled */
    #if (CapSense_1_MULTI_FREQ_SCAN_EN == CapSense_1_ENABLE)
        CapSense_1_scanFreqIndex = CapSense_1_FREQ_CHANNEL_0;
    #endif

    #if (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        if (0u != CapSense_1_curRamSnsPtr->subConvNum)
        {
            /* Set busy flag and start conversion */
            CapSense_1_SetBusyFlags(CapSense_1_SW_STS_BUSY);

            #if (CapSense_1_ENABLE != CapSense_1_BLOCK_OFF_AFTER_SCAN_EN)
                #if(CapSense_1_CSX_ANALOG_STARTUP_DELAY_US > 0uL)
                    Cy_SysLib_DelayUs(CapSense_1_CSX_ANALOG_STARTUP_DELAY_US);
                #endif /* (CapSense_1_CSX_ANALOG_STARTUP_DELAY_US > 0uL) */
            #endif /* (CapSense_1_ENABLE != CapSense_1_BLOCK_OFF_AFTER_SCAN_EN) */
            CapSense_1_SsCSXStartSample();
        }
    #else
        /* Set busy flag and start conversion */
        CapSense_1_SetBusyFlags(CapSense_1_SW_STS_BUSY);

        #if (CapSense_1_ENABLE != CapSense_1_BLOCK_OFF_AFTER_SCAN_EN)
            #if(CapSense_1_CSX_ANALOG_STARTUP_DELAY_US > 0uL)
                Cy_SysLib_DelayUs(CapSense_1_CSX_ANALOG_STARTUP_DELAY_US);
            #endif /* (CapSense_1_CSX_ANALOG_STARTUP_DELAY_US > 0uL) */
        #endif /* (CapSense_1_ENABLE != CapSense_1_BLOCK_OFF_AFTER_SCAN_EN) */
        CapSense_1_SsCSXStartSample();
    #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */
}


