swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
/*******************************************************************************
* Function Name: CapSense_1_SsCSXPostMultiScan
****************************************************************************//**
*
* \brief
*   ISR function implements the multiple-sensor scanning for un-ganged CSX widgets.
*   This function is called by the Component ISR only, it should not be used by
*   the application layer.
*
*******************************************************************************/

static void CapSense_1_SsCSXPostMultiScan(void)
{
    #ifdef CapSense_1_ENTRY_CALLBACK
        CapSense_1_EntryCallback();
    #endif /* CapSense_1_ENTRY_CALLBACK */

    /* Copy scan result into sensor raw count array */
    CapSense_1_curRamSnsPtr->raw[CapSense_1_scanFreqIndex] = \
                             (CapSense_1_csxScanPeriod - CapSense_1_csxRawCount);

    #if (CapSense_1_ENABLE == CapSense_1_MULTI_FREQ_SCAN_EN)
        /* Increment multi frequency scan index if all channels are not scanned */
        if (CapSense_1_FREQ_CHANNEL_2 > CapSense_1_scanFreqIndex)
        {
            /* Change multi-frequency channel and start sample */
            CapSense_1_scanFreqIndex++;
            CapSense_1_SsChangeClkFreq((uint32)CapSense_1_scanFreqIndex);
            CapSense_1_SsCSXStartSample();
        }
        else
    #endif
        {
            #if (CapSense_1_MULTI_FREQ_SCAN_EN == CapSense_1_ENABLE)
                /* All channels are scanned. Reset the multi frequency scan channel */
                CapSense_1_scanFreqIndex = CapSense_1_FREQ_CHANNEL_0;
                CapSense_1_SsChangeClkFreq(CapSense_1_FREQ_CHANNEL_0);
            #endif

            #if (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
                /* Disconnect Tx/Rx electrodes of previously scanned sensor as preparation for next sensor scan */
                CapSense_1_CSXDisconnectTx(CapSense_1_curTxIOPtr);
                CapSense_1_CSXDisconnectRx(CapSense_1_curRxIOPtr);

                /* Increment sensor until non-skipped is found */
                do
                {
                    /* Increment sensor index to configure next sensor in widget */
                    CapSense_1_sensorIndex++;

                    /* Increment sensor pointers */
                    CapSense_1_curRamSnsPtr++;
                    CapSense_1_curWdgtTotalTx--;
                    if (CapSense_1_curWdgtTotalTx > 0u)
                    {
                        CapSense_1_curTxIOPtr++;
                    }
                    else
                    {
                        CapSense_1_curWdgtTotalRx--;
                        if (CapSense_1_curWdgtTotalRx > 0u)
                        {
                            CapSense_1_curRxIOPtr++;
                            CapSense_1_curWdgtTotalTx  = CapSense_1_curFlashWdgtPtr->numRows;
                            CapSense_1_curTxIOPtr = (CapSense_1_FLASH_IO_STRUCT const *)CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
                            CapSense_1_curTxIOPtr = & CapSense_1_curTxIOPtr[(CapSense_1_curFlashWdgtPtr->numCols)];
                        }
                    }
                } while ((CapSense_1_curWdgtTotalRx != 0u) && (CapSense_1_curRamSnsPtr->subConvNum == 0u));

                /* Perform the next scan or switch to the next widget */
                if(CapSense_1_curWdgtTotalRx != 0u)
                {
                    /* Connect Tx/Rx electrodes for the next scan */
                    CapSense_1_CSXConnectTx(CapSense_1_curTxIOPtr);
                    CapSense_1_CSXConnectRx(CapSense_1_curRxIOPtr);
                    /* Reset scan result holder, and initiate scan */
                    CapSense_1_SsCSXStartSample();
                }
                else
                {
                    /* Call scan next widget API if requested, if not, complete scan */
                    if (CapSense_1_requestScanAllWidget != 0u)
                    {
                        CapSense_1_SsPostAllWidgetsScan();
                    }
                    else
                    {
                        CapSense_1_dsRam.scanCounter++;
                        CapSense_1_ClrBusyFlags(CapSense_1_SW_STS_BUSY);
                    }
                }
            #else /* (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

                /*
                *  Disconnect Tx electrodes of previously scanned sensor as
                *  preparation for next sensor scan
                */
                CapSense_1_CSXDisconnectTx (CapSense_1_curTxIOPtr);

                /* Increment sensor index to configure next sensor in widget */
                CapSense_1_sensorIndex++;

                /*
                *  Initiate scan for next sensor in widget, if all the sensors in
                *  widget are not scanned
                */
                CapSense_1_curWdgtTotalTx--;
                if (CapSense_1_curWdgtTotalTx > 0u)
                {
                    /*
                    *  1. Increment pointer to next Tx
                    *  2. Connect next Rx for scan
                    *  3. Increment pointer to sns data
                    */
                    CapSense_1_curTxIOPtr++;
                    CapSense_1_CSXConnectTx (CapSense_1_curTxIOPtr);
                    CapSense_1_curRamSnsPtr++;

                    /* Reset scan result holder, and initiate scan */
                    CapSense_1_SsCSXStartSample();
                }

                /* Check if all Rx are looped through */
                else
                {
                    CapSense_1_curWdgtTotalRx--;
                    if (CapSense_1_curWdgtTotalRx > 0u)
                    {
                        /*
                        *  1. Disconnect current Rx electrode
                        *  2. Connect next Rx electrode
                        *  3. Re-initialize total Tx to be scanned per Rx
                        *  4. Find first Tx electrode again
                        *  5. Connect first Tx electrode
                        */
                        CapSense_1_CSXDisconnectRx(CapSense_1_curRxIOPtr);
                        CapSense_1_curRxIOPtr++;
                        CapSense_1_CSXConnectRx(CapSense_1_curRxIOPtr);
                        CapSense_1_curWdgtTotalTx  = CapSense_1_curFlashWdgtPtr->numRows;
                        CapSense_1_curTxIOPtr = (CapSense_1_FLASH_IO_STRUCT const *)CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
                        CapSense_1_curTxIOPtr = & CapSense_1_curTxIOPtr[(CapSense_1_curFlashWdgtPtr->numCols)];
                        CapSense_1_CSXConnectTx(CapSense_1_curTxIOPtr);

                        /* Increment RAM sensor pointer pointer */
                        CapSense_1_curRamSnsPtr++;

                        /* Initiate sample */
                        CapSense_1_SsCSXStartSample();
                    }
                    else
                    {
                        /* If all the sensors are scanned, disconnect Tx */
                        CapSense_1_CSXDisconnectRx(CapSense_1_curRxIOPtr);

                        /* Call scan next widget API if requested, if not, complete scan */
                        if (CapSense_1_requestScanAllWidget != 0u)
                        {
                            CapSense_1_SsPostAllWidgetsScan();
                        }
                        else
                        {
                            /*
                            *  All pending scans completed,
                            *    1. update the counter to indicat same
                            *    2. Clear busy state as scanning is completed
                            */
                            CapSense_1_dsRam.scanCounter++;
                            CapSense_1_ClrBusyFlags(CapSense_1_SW_STS_BUSY);
                        }
                    }
                }
            #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */
        }

    #ifdef CapSense_1_EXIT_CALLBACK
        CapSense_1_ExitCallback();
    #endif /* CapSense_1_EXIT_CALLBACK */
}


