swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
/*******************************************************************************
* Function Name: CapSense_1_SsCSXPostMultiScanGanged
****************************************************************************//**
*
* \brief
*   The ISR function implements the multiple-sensor scanning for ganged CSX widgets.
*   This function is called by the Component ISR only, should not be used by
*   the application layer.
*
* \details
*   The ISR function implements the multiple-sensor scanning for ganged CSX widgets.
*   This function is called by the Component ISR only, should not be used by
*   the application layer.
*
*******************************************************************************/
#if (CapSense_1_CSX_GANGED_SNS_EN == 1u)

static void CapSense_1_SsCSXPostMultiScanGanged(void)
{
    uint32 numElectrodes;

    #ifdef CapSense_1_ENTRY_CALLBACK
        CapSense_1_EntryCallback();
    #endif /* CapSense_1_ENTRY_CALLBACK */

    /* Copy scan result into sensor raw count array */
    CapSense_1_curRamSnsPtr->raw[CapSense_1_scanFreqIndex] = \
                    (CapSense_1_csxScanPeriod - CapSense_1_csxRawCount);

    #if (CapSense_1_ENABLE == CapSense_1_MULTI_FREQ_SCAN_EN)
        /* Increment multi frequency scan index if all channels are not scanned */
        if (CapSense_1_FREQ_CHANNEL_2 > CapSense_1_scanFreqIndex)
        {
            /* Change multi-frequency channel and start sample */
            CapSense_1_scanFreqIndex++;
            CapSense_1_SsChangeClkFreq((uint32)CapSense_1_scanFreqIndex);
            CapSense_1_SsCSXStartSample();
        }
        else
    #endif
        {
            #if (CapSense_1_MULTI_FREQ_SCAN_EN == CapSense_1_ENABLE)
                /* All channels are scanned. Reset the multi frequency scan channel */
                CapSense_1_scanFreqIndex = CapSense_1_FREQ_CHANNEL_0;
                CapSense_1_SsChangeClkFreq(CapSense_1_FREQ_CHANNEL_0);
            #endif

            #if (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
                /* Disconnect Tx electrodes of previously scanned sensor as preparation for next sensor scan */
                numElectrodes = CapSense_1_curGangTxPtr->numPins;
                CapSense_1_curTxIOPtr = &CapSense_1_ioList[CapSense_1_curGangTxPtr->firstPinId];
                do
                {
                    CapSense_1_CSXDisconnectTx(CapSense_1_curTxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);
                /* Disconnect Rx electrodes of previously scanned sensor as preparation for next sensor scan */
                numElectrodes = CapSense_1_curGangRxPtr->numPins;
                CapSense_1_curRxIOPtr = &CapSense_1_ioList[CapSense_1_curGangRxPtr->firstPinId];
                do
                {
                    CapSense_1_CSXDisconnectRx(CapSense_1_curRxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);

                /* Increment sensor until non-skipped is found */
                do
                {
                    /* Increment sensor index to configure next sensor in widget */
                    CapSense_1_sensorIndex++;

                    /* Increment RAM sensor pointer */
                    CapSense_1_curRamSnsPtr++;
                    CapSense_1_curWdgtTotalTx--;
                    if (CapSense_1_curWdgtTotalTx > 0u)
                    {
                        CapSense_1_curGangTxPtr++;
                    }
                    else
                    {
                        /* Check if all Rx are scanned, if not, initiate scan for next Rx */
                        CapSense_1_curWdgtTotalRx--;
                        if (CapSense_1_curWdgtTotalRx > 0u)
                        {
                            CapSense_1_curGangRxPtr++;
                            CapSense_1_curWdgtTotalTx = CapSense_1_curFlashWdgtPtr->numRows;
                            CapSense_1_curGangTxPtr = CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
                            CapSense_1_curGangTxPtr += CapSense_1_curFlashWdgtPtr->numCols;
                        }
                    }
                } while ((CapSense_1_curWdgtTotalRx != 0u) && (CapSense_1_curRamSnsPtr->subConvNum == 0u));

                if(CapSense_1_curWdgtTotalRx != 0u)
                {
                    /* Connect Tx electrodes for the next scan */
                    numElectrodes = CapSense_1_curGangTxPtr->numPins;
                    CapSense_1_curTxIOPtr = &CapSense_1_ioList[CapSense_1_curGangTxPtr->firstPinId];
                    do
                    {
                        CapSense_1_CSXConnectTx(CapSense_1_curTxIOPtr++);
                        numElectrodes--;
                    } while (0u != numElectrodes);
                    /* Connect Tx electrodes for the next scan */
                    numElectrodes = CapSense_1_curGangRxPtr->numPins ;
                    CapSense_1_curRxIOPtr = &CapSense_1_ioList[CapSense_1_curGangRxPtr->firstPinId];
                    do
                    {
                        CapSense_1_CSXConnectRx(CapSense_1_curRxIOPtr++);
                        numElectrodes--;
                    } while (0u != numElectrodes);
                    /* Reset scan result holder, and initiate scan */
                    CapSense_1_SsCSXStartSample();
                }
                else
                {
                    /* Call scan next widget API if requested, if not, complete scan */
                    if (CapSense_1_requestScanAllWidget != 0u)
                    {
                        CapSense_1_SsPostAllWidgetsScan();
                    }
                    else
                    {
                        CapSense_1_dsRam.scanCounter++;
                        CapSense_1_ClrBusyFlags(CapSense_1_SW_STS_BUSY);
                    }
                }
            #else /* (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

                /* Disconnect ALL pins of previously scanned Tx */
                numElectrodes = CapSense_1_curGangTxPtr->numPins ;
                CapSense_1_curTxIOPtr = &CapSense_1_ioList[CapSense_1_curGangTxPtr->firstPinId];
                do
                {
                    CapSense_1_CSXDisconnectTx (CapSense_1_curTxIOPtr++);
                    numElectrodes--;
                } while (0u != numElectrodes);

