swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
                /* Increment sensor index to configure next sensor in widget */
                CapSense_1_sensorIndex++;

                /* Check if all Tx are scanned, if not, initiate scan for next Tx */
                CapSense_1_curWdgtTotalTx--;
                if (CapSense_1_curWdgtTotalTx > 0u)
                {
                    /*
                    *  1. Find pointer of next Tx (ganged)
                    *  2. Connect all Tx pins
                    */
                    CapSense_1_curGangTxPtr++;
                    numElectrodes = CapSense_1_curGangTxPtr->numPins ;
                    CapSense_1_curTxIOPtr = &CapSense_1_ioList[CapSense_1_curGangTxPtr->firstPinId];
                    do
                    {
                        CapSense_1_CSXConnectTx(CapSense_1_curTxIOPtr++);
                        numElectrodes--;
                    } while (0u != numElectrodes);

                    /* Increment RAM pointer to next sensor */
                    CapSense_1_curRamSnsPtr++;

                    /* Reset scan result holder and initiate scan */
                    CapSense_1_SsCSXStartSample();
                }
                else
                {
                    /* Check if all Rx are scanned, if not, initiate scan for next Rx */
                    CapSense_1_curWdgtTotalRx--;
                    if (CapSense_1_curWdgtTotalRx > 0u)
                    {
                        /* 1. Disconnect current Rx ALL pins */
                        numElectrodes = CapSense_1_curGangRxPtr->numPins ;
                        CapSense_1_curRxIOPtr = &CapSense_1_ioList[CapSense_1_curGangRxPtr->firstPinId];
                        do
                        {
                            CapSense_1_CSXDisconnectRx(CapSense_1_curRxIOPtr++);
                            numElectrodes--;
                        } while (0u != numElectrodes);

                        /* 2. Connect next Rx ALL pins */
                        CapSense_1_curGangRxPtr++;
                        numElectrodes = CapSense_1_curGangRxPtr->numPins ;
                        CapSense_1_curRxIOPtr = &CapSense_1_ioList[CapSense_1_curGangRxPtr->firstPinId];
                        do
                        {
                            CapSense_1_CSXConnectRx(CapSense_1_curRxIOPtr++);
                            numElectrodes--;
                        } while (0u != numElectrodes);

                        /*
                        *  3. Re-initialize total Tx to be scanned per Rx
                        *  4. Find first Tx  again
                        *  5. Connect first Tx ALL pins
                        */
                        CapSense_1_curWdgtTotalTx = CapSense_1_curFlashWdgtPtr->numRows;
                        CapSense_1_curGangTxPtr = CapSense_1_curFlashWdgtPtr->ptr2SnsFlash;
                        CapSense_1_curGangTxPtr += CapSense_1_curFlashWdgtPtr->numCols;

                        /* 6. Connect Tx ALL pins */
                        numElectrodes = CapSense_1_curGangTxPtr->numPins ;
                        CapSense_1_curTxIOPtr = &CapSense_1_ioList[CapSense_1_curGangTxPtr->firstPinId];
                        do
                        {
                            CapSense_1_CSXConnectTx(CapSense_1_curTxIOPtr++);
                            numElectrodes--;
                        } while (0u != numElectrodes);

                        /* Increment RAM pointer to next sensor */
                        CapSense_1_curRamSnsPtr++;

                        /* Reset scan result holder and initiate scan */
                        CapSense_1_SsCSXStartSample();
                    }
                    else
                    {
                        /* Disconnect ALL electrodes of previously scanned Rx */
                        numElectrodes = CapSense_1_curGangRxPtr->numPins ;
                        CapSense_1_curRxIOPtr = &CapSense_1_ioList[CapSense_1_curGangRxPtr->firstPinId];
                        do
                        {
                            CapSense_1_CSXDisconnectRx(CapSense_1_curRxIOPtr++);
                            numElectrodes--;
                        } while (0u != numElectrodes);

                        /* Call scan next widget API if requested, if not, complete scan */
                        if (CapSense_1_requestScanAllWidget != 0u)
                        {
                            CapSense_1_SsPostAllWidgetsScan();
                        }
                        else
                        {
                            /*
                            *  All pending scans completed,
                            *    1. update the counter to indicate same
                            *    2. Clear busy state as scanning is completed
                            */
                            CapSense_1_dsRam.scanCounter++;
                            CapSense_1_ClrBusyFlags(CapSense_1_SW_STS_BUSY);
                        }
                    }
                }
            #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */
        }

    #ifdef CapSense_1_EXIT_CALLBACK
        CapSense_1_ExitCallback();
    #endif /* CapSense_1_EXIT_CALLBACK */
}

#endif  /* (CapSense_1_CSX_GANGED_SNS_EN == 1u) */

/*******************************************************************************
* Function Name: CapSense_1_SsCSXPostSingleScan
****************************************************************************//**
*
* \brief
*   The ISR function for single-sensor scanning implementation.
*
* \details
*   This function is used by CapSense_1 ISR in the CSX scanning mode to implement
*   the single-sensor scanning.
*   This function should not be used by the application layer.
*
*******************************************************************************/

static void CapSense_1_SsCSXPostSingleScan(void)
{
    #ifdef CapSense_1_ENTRY_CALLBACK
        CapSense_1_EntryCallback();
    #endif /* CapSense_1_ENTRY_CALLBACK */

    /*
    * Copy scan result into sensor raw count array and clear busy flag
    *    No sensor is connected or disconnected in this function
    *    Calling CapSense_1_ScanExt from application would perform
    *    one more scan of same sensor. Specifically for low-power mode.
    */
    CapSense_1_curRamSnsPtr->raw[CapSense_1_scanFreqIndex] =
                        (CapSense_1_csxScanPeriod - CapSense_1_csxRawCount);

    #if (CapSense_1_ENABLE == CapSense_1_MULTI_FREQ_SCAN_EN)
        /* Increment multi frequency scan index if all channels are not scanned */
        if (CapSense_1_FREQ_CHANNEL_2 > CapSense_1_scanFreqIndex)
        {
            /* Change multi-frequency channel and start sample */
            CapSense_1_scanFreqIndex++;
            CapSense_1_SsChangeClkFreq((uint32)CapSense_1_scanFreqIndex);
            CapSense_1_SsCSXStartSample();
        }
        else
    #endif
        {
            #if (CapSense_1_MULTI_FREQ_SCAN_EN == CapSense_1_ENABLE)
                /* All channels are scanned. Reset the multi frequency scan channel */
                CapSense_1_scanFreqIndex = CapSense_1_FREQ_CHANNEL_0;
                CapSense_1_SsChangeClkFreq(CapSense_1_FREQ_CHANNEL_0);
            #endif
            /*
            * All pending scans completed,
            *   1. Update the counter to indicate same
            *   2. Clear busy state as scanning is completed
            */
            CapSense_1_dsRam.scanCounter++;
            CapSense_1_ClrBusyFlags(CapSense_1_SW_STS_BUSY);
        }

    #ifdef CapSense_1_EXIT_CALLBACK
        CapSense_1_ExitCallback();
    #endif /* CapSense_1_EXIT_CALLBACK */
}

