swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
/*******************************************************************************
* Function Name: CapSense_1_CSXCalibrateWidget
****************************************************************************//**
*
* \brief
*  Calibrates the raw count values of all the sensors/nodes in a CSX widget.
*
* \details
*  Performs a successive approximation search algorithm to find appropriate
*  IDAC values for sensors in the specified widget that provides a raw count
*  to the level specified by the target parameter.
*
*  This function is available when the CSX Enable IDAC auto-calibration
*  parameter is enabled.
*
* \param widgetId
*  Specifies the ID number of the CSX widget to calibrate its raw count.
*  A macro for the widget ID can be found in the
*  CapSense_1 Configuration header file defined as
*  CapSense_1_<WidgetName>_WDGT_ID.
*
* \param target
*  Specifies the calibration target in percentages of the maximum raw count.
*
*******************************************************************************/
#if (CapSense_1_ENABLE == CapSense_1_CSX_IDAC_AUTOCAL_EN)

void CapSense_1_CSXCalibrateWidget(uint32 widgetId, uint16 target)
{
    /* Variable to calculate raw count target */
    uint32 rawTarget;
    /* Counter for loop execution */
    uint32 totalSns;
    /* Counter for loop execution */
    uint32 calibrationIndex;

    /* Currently used IDAC-bit */
    uint8 curIdacMask = (1u << (CapSense_1_CSX_IDAC_BITS_USED-1u));
    /* Next used IDAC-bit */
    uint8 nextIdacMask = (curIdacMask >> 1u);

    /* initialize ptr to sensor structures */
    CapSense_1_curRamSnsPtr = (CapSense_1_RAM_SNS_STRUCT *)CapSense_1_dsFlash.wdgtArray[widgetId].ptr2SnsRam;

    #if (CapSense_1_DISABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        /* Calculate target raw count */
        CapSense_1_csxScanPeriod  = CapSense_1_SsCalcCsxScanPeriod(
            (CapSense_1_RAM_WD_BASE_STRUCT *)CapSense_1_dsFlash.wdgtArray[widgetId].ptr2WdgtRam);
        rawTarget = CapSense_1_csxScanPeriod;
        rawTarget = (rawTarget * target) / CapSense_1_PERCENTAGE_100;
    #endif /* (CapSense_1_DISABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

    if (CapSense_1_SENSE_METHOD_CSX_E ==
       CapSense_1_GET_SENSE_METHOD(&CapSense_1_dsFlash.wdgtArray[widgetId]))
    {
        /* Find out total sensors/nodes in widget */
        totalSns = ((uint32)CapSense_1_dsFlash.wdgtArray[widgetId].numCols *
                    (uint32)CapSense_1_dsFlash.wdgtArray[widgetId].numRows);

        /* Clear raw count registers and IDAC registers of all the sensors/nodes */
        for (calibrationIndex = 0u; calibrationIndex < totalSns; calibrationIndex++)
        {
            CapSense_1_curRamSnsPtr->raw[CapSense_1_FREQ_CHANNEL_0] = 0u;
            CapSense_1_curRamSnsPtr->idacComp[CapSense_1_FREQ_CHANNEL_0] = curIdacMask;
            #if (CapSense_1_ENABLE == CapSense_1_MULTI_FREQ_SCAN_EN)
                CapSense_1_curRamSnsPtr->raw[CapSense_1_FREQ_CHANNEL_1] = 0u;
                CapSense_1_curRamSnsPtr->raw[CapSense_1_FREQ_CHANNEL_2] = 0u;
                CapSense_1_curRamSnsPtr->idacComp[CapSense_1_FREQ_CHANNEL_1] = curIdacMask;
                CapSense_1_curRamSnsPtr->idacComp[CapSense_1_FREQ_CHANNEL_2] = curIdacMask;
            #endif
            CapSense_1_curRamSnsPtr++;
        }

        /* Perform binary search for accurate IDAC value for each sensor/node */
        do
        {
            /* Scan all the sensors/nodes in widget */
            (void)CapSense_1_SetupWidget(widgetId);
            (void)CapSense_1_Scan();

            while ((CapSense_1_dsRam.status & CapSense_1_SW_STS_BUSY) != 0u)
            {
            }

            /* Get access to sensor data */
            CapSense_1_curRamSnsPtr = (CapSense_1_RAM_SNS_STRUCT *)CapSense_1_dsFlash.wdgtArray[widgetId].ptr2SnsRam;

            /* Check raw count and adjust IDAC, loop through all the sensors/nodes */
            for (calibrationIndex = 0u; calibrationIndex < totalSns; calibrationIndex++)
            {
                /* Calculate raw count target for specified node */
                #if (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
                    rawTarget = (CapSense_1_SsCSXOversample() * target) / CapSense_1_PERCENTAGE_100;
                #endif

                /* Check if current raw count is above target,
                *   if yes, clear the MS bit of bit
                *   if no, keep the MS bit and set next bit
                */
                if (CapSense_1_curRamSnsPtr->raw[CapSense_1_FREQ_CHANNEL_0] > rawTarget)
                {
                    CapSense_1_curRamSnsPtr->idacComp[CapSense_1_FREQ_CHANNEL_0] &= (uint8)(~curIdacMask);
                }
                CapSense_1_curRamSnsPtr->idacComp[CapSense_1_FREQ_CHANNEL_0] |= nextIdacMask;

                #if (CapSense_1_ENABLE == CapSense_1_MULTI_FREQ_SCAN_EN)
                    if (CapSense_1_curRamSnsPtr->raw[CapSense_1_FREQ_CHANNEL_1] > rawTarget)
                    {
                        CapSense_1_curRamSnsPtr->idacComp[CapSense_1_FREQ_CHANNEL_1] &= (uint8)(~curIdacMask);
                    }

                    if (CapSense_1_curRamSnsPtr->raw[CapSense_1_FREQ_CHANNEL_2] > rawTarget)
                    {
                        CapSense_1_curRamSnsPtr->idacComp[CapSense_1_FREQ_CHANNEL_2] &= (uint8)(~curIdacMask);
                    }

                    CapSense_1_curRamSnsPtr->idacComp[CapSense_1_FREQ_CHANNEL_1] |= nextIdacMask;
                    CapSense_1_curRamSnsPtr->idacComp[CapSense_1_FREQ_CHANNEL_2] |= nextIdacMask;
                #endif
                CapSense_1_curRamSnsPtr++;
            }

            /* Shift both current idac and pre Idac values to right by 1 */
            curIdacMask = nextIdacMask;
            nextIdacMask = nextIdacMask >> 1u;
        }
        while (curIdacMask != 0u);
    }
}

#endif /* (CapSense_1_CSX_IDAC_AUTOCAL_EN == CapSense_1_ENABLE) */

/*******************************************************************************
* Function Name: CapSense_1_SsCSXStartSample
****************************************************************************//**
*
* \brief
*   Starts scanning for the CSX widget.
*
* \details
*   Starts scanning for the CSX widget.
*
*******************************************************************************/
static void CapSense_1_SsCSXStartSample(void)
{
    uint32 tmpRegVal;

    tmpRegVal = (uint32)CapSense_1_curRamSnsPtr->idacComp[CapSense_1_scanFreqIndex];
    tmpRegVal = (tmpRegVal & CapSense_1_CSD_IDACA_VAL_MSK) | CapSense_1_DEFAULT_CSD_IDACA_CFG;
    CY_SET_REG32(CapSense_1_CSD_IDACA_PTR, tmpRegVal);

    #if (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
        /* Configure node-specific number of sub-conversion */
        CapSense_1_csxScanPeriod = (uint16)CapSense_1_SsCSXOversample();
        CY_SET_REG32(CapSense_1_CSD_SEQ_NORM_CNT_PTR, (uint32)CapSense_1_curRamSnsPtr->subConvNum);
    #endif /* (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

    /* Clear scan result holder */
    CapSense_1_csxRawCount = 0u;

    #ifdef CapSense_1_START_SAMPLE_CALLBACK
        CapSense_1_StartSampleCallback(CapSense_1_widgetIndex, CapSense_1_sensorIndex);
    #endif /* CapSense_1_START_SAMPLE_CALLBACK */

