swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
    CapSense_1_SsCSXStartSampleExt();
}

/*******************************************************************************
* Function Name: CapSense_1_CSXConnectTx
****************************************************************************//**
*
* \brief
*  Connects a Tx electrode to the CSX scanning hardware.
*
* \details
*  This function connects a port pin (Tx electrode) to the CSD_SENSE signal.
*  It is assumed that drive mode of the port pin is already set to STRONG
*  in the HSIOM_PORT_SELx register.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time when there is only one port pin for an
*  electrode for example).
*
* \param txPtr
*  Specifies the pointer to the FLASH_IO_STRUCT object belonging to a sensor
*  to be connected to the sensing HW block as a Tx pin.
*
*******************************************************************************/
void CapSense_1_CSXConnectTx(CapSense_1_FLASH_IO_STRUCT const *txPtr)
{
    uint32 interruptState;

    interruptState = Cy_SysLib_EnterCriticalSection();

    Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)txPtr->pcPtr, (uint32)txPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF);
    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)txPtr->pcPtr, (uint32)txPtr->pinNumber, (en_hsiom_sel_t)CapSense_1_HSIOM_SEL_CSD_SHIELD);

    Cy_SysLib_ExitCriticalSection(interruptState);
}

/*******************************************************************************
* Function Name: CapSense_1_CSXConnectRx
****************************************************************************//**
*
* \brief
*  Connects an Rx electrode to the CSX scanning hardware.
*
* \details
*  This function connects a port pin (Rx electrode) to AMUXBUS-A and sets
*  drive mode of the port pin to High-Z in the GPIO_PRT_PCx register.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time when there is only one port pin for an
*  electrode for example).
*
* \param rxPtr
*  Specifies the pointer to the FLASH_IO_STRUCT object belonging to a sensor
*  to be connected to the sensing HW block as an Rx pin.
*
*******************************************************************************/
void CapSense_1_CSXConnectRx(CapSense_1_FLASH_IO_STRUCT const *rxPtr)
{
    uint32 interruptState;

    interruptState = Cy_SysLib_EnterCriticalSection();

    Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)rxPtr->pcPtr, (uint32)rxPtr->pinNumber, CY_GPIO_DM_ANALOG);
    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)rxPtr->pcPtr, (uint32)rxPtr->pinNumber, (en_hsiom_sel_t)CapSense_1_HSIOM_SEL_AMUXA);

    Cy_SysLib_ExitCriticalSection(interruptState);
}

/*******************************************************************************
* Function Name: CapSense_1_CSXDisconnectTx
****************************************************************************//**
*
* \brief
*  Disconnects a Tx electrode from the CSX scanning hardware.
*
* \details
*  This function disconnects a port pin (Tx electrode) from the CSD_SENSE
*  signal and configures the port pin to the strong drive mode. It is assumed
*  that the data register (GPIO_PRTx_DR) of the port pin is already 0.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time when there is only one port pin for an
*  electrode for example).
*
* \param txPtr
*  Specifies the pointer to the FLASH_IO_STRUCT object belonging to a Tx pin
*  sensor to be disconnected from the sensing HW block.
*
*******************************************************************************/
void CapSense_1_CSXDisconnectTx(CapSense_1_FLASH_IO_STRUCT const *txPtr)
{
    uint32 interruptState;

    interruptState = Cy_SysLib_EnterCriticalSection();
    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)txPtr->pcPtr, (uint32)txPtr->pinNumber, (en_hsiom_sel_t)CapSense_1_HSIOM_SEL_GPIO);
    Cy_SysLib_ExitCriticalSection(interruptState);
}

/*******************************************************************************
* Function Name: CapSense_1_CSXDisconnectRx
****************************************************************************//**
*
* \brief
*  Disconnects an Rx electrode from the CSX scanning hardware.
*
* \details
*  This function disconnects a port pin (Rx electrode) from AMUXBUS_A and
*  configures the port pin to the strong drive mode. It is assumed that the
*  data register (GPIO_PRTx_DR) of the port pin is already 0.
*
*  Calling this function directly from the application layer is not
*  recommended. This function is used to implement only the user's specific
*  use cases (for faster execution time when there is only one port pin for
*  an electrode for example).
*
* \param rxPtr
*  Specifies the pointer to the FLASH_IO_STRUCT object belonging to an Rx pin
*  sensor to be disconnected from the sensing HW block.
*
*******************************************************************************/
void CapSense_1_CSXDisconnectRx(CapSense_1_FLASH_IO_STRUCT const *rxPtr)
{
    uint32  interruptState;

    interruptState = Cy_SysLib_EnterCriticalSection();

    Cy_GPIO_SetHSIOM((GPIO_PRT_Type*)rxPtr->pcPtr, (uint32)rxPtr->pinNumber, (en_hsiom_sel_t)CapSense_1_HSIOM_SEL_GPIO);
    Cy_GPIO_SetDrivemode((GPIO_PRT_Type*)rxPtr->pcPtr, (uint32)rxPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF);
    Cy_GPIO_Clr((GPIO_PRT_Type*)rxPtr->pcPtr, (uint32)rxPtr->pinNumber);

    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
* Function Name: CapSense_1_SsCSXGetTxClkDivider
****************************************************************************//**
*
* \brief
*  This function gets the Sense Clock Divider value for one-dimension widgets
*  and the Column Sense Clock divider value for two-dimension widgets.
*
* \details
*  This function gets the Sense Clock Divider value based on the Component
*  configuration. The function is applicable for one-dimension widgets and for
*  two-dimension widgets.
*
* \param
*  widgetId Specifies the ID of the widget.
*
* \return The Sense Clock Divider value for one-dimension widgets
*         and the Column Sense Clock divider value for two-dimension widgets.
*
*******************************************************************************/
uint32 CapSense_1_SsCSXGetTxClkDivider(uint32 widgetId)
{
    uint32 retVal;

    /* Get sense divider based on configuration */
    #if (CapSense_1_DISABLE == CapSense_1_CSX_COMMON_TX_CLK_EN)
        CapSense_1_RAM_WD_BASE_STRUCT *ptrWdgt;

        ptrWdgt = (CapSense_1_RAM_WD_BASE_STRUCT *)
        CapSense_1_dsFlash.wdgtArray[widgetId].ptr2WdgtRam;

