swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
        retVal = (uint32)(ptrWdgt->snsClk);
    #else
        retVal = (uint32)CapSense_1_dsRam.snsCsxClk;
    #endif /* (CapSense_1_DISABLE == CapSense_1_CSX_COMMON_TX_CLK_EN) */

    if(widgetId == 0uL)
    {
        ;
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: CapSense_1_SsCalcCsxScanPeriod
****************************************************************************//**
*
* \brief
*  Calculates scan period for a desired CSX widget.
*
* \details
*  This function calculates a scan period for a desired CSX widget considering
*  common TX clock option.
*
* \param wdgtPtr
*  The pointer to a register map object that contains widget information.
*
* \return
*  Returns the CSX scan period for the widget.
*
*******************************************************************************/
static uint16 CapSense_1_SsCalcCsxScanPeriod(CapSense_1_RAM_WD_BASE_STRUCT const *wdgtPtr)
{
    uint32 temp;

    #if(CapSense_1_DISABLE == CapSense_1_CSX_COMMON_TX_CLK_EN)
        temp = (uint32)(wdgtPtr->snsClk);
    #else
        temp = (uint32)(CapSense_1_dsRam.snsCsxClk);
    #endif /* (CapSense_1_DISABLE == CapSense_1_CSX_COMMON_TX_CLK_EN) */

    temp = CY_LO16((uint32)wdgtPtr->resolution * (temp - CapSense_1_CSX_DEADBAND_CYCLES_NUMBER));

    /* return the scan period */
    return ((uint16)temp);
}


/**
* \cond SECTION_CYSENSE_INTERRUPT
* \addtogroup group_cysense_interrupt
* \{
*/
/*******************************************************************************
* Function Name: CapSense_1_CSXScanISR
****************************************************************************//**
*
* \brief
*  This is an internal ISR function to handle the CSX sensing method operation.
*
* \details
*  This handler covers the following functionality:
*   - Read the result of the measurement and store it into the corresponding register of
*     the data structure.
*   - If the Noise Metric functionality is enabled, then check the number of bad
*     conversions and repeat the scan of the current sensor of the number of bad
*     conversions is greater than the Noise Metric Threshold.
*   - Initiate the scan of the next sensor for multiple sensor scanning mode.
*   - Update the Status register in the data structure.
*   - Switch the HW IP block to the default state if scanning of all the sensors is
*     completed.
*
*******************************************************************************/
void CapSense_1_CSXScanISR(void)
{
    uint32 tmpRawCount;

    #if(0u != CapSense_1_CSX_NOISE_METRIC_EN)
        uint32 tmpRegVal;
    #endif /* (0u != CapSense_1_CSX_NOISE_METRIC_EN) */

    #if(0u != CapSense_1_CSX_NOISE_METRIC_EN)
        static uint32 CapSense_1_resamplingCyclesCnt = CapSense_1_RESAMPLING_CYCLES_MAX_NUMBER;
    #endif /* (0u != CapSense_1_CSX_NOISE_METRIC_EN) */

    /* Disable interrupt */
    #if defined(CapSense_1_ISR__INTC_ASSIGNED)
        NVIC_DisableIRQ(CapSense_1_ISR_cfg.intrSrc);
    #endif

    /* Clear all pending interrupts of CSD block */
    CY_SET_REG32(CapSense_1_CSD_INTR_PTR, CapSense_1_CSD_INTR_ALL_MSK);
    (void)CY_GET_REG32(CapSense_1_CSD_INTR_PTR);

    tmpRawCount  = (uint16)(CapSense_1_CSD_RESULT_VAL1_REG &
                                             CapSense_1_CSD_RESULT_VAL1_VALUE_MSK);

    tmpRawCount += (uint16)(CapSense_1_CSD_RESULT_VAL2_REG &
                                             CapSense_1_CSD_RESULT_VAL2_VALUE_MSK);

    /* This workaround neded to prevent overflow in the SW register map. Cypress ID #234358 */
    if(tmpRawCount > (uint32)CapSense_1_csxScanPeriod)
    {
        CapSense_1_csxRawCount = CapSense_1_csxScanPeriod;
    }
    else
    {
        CapSense_1_csxRawCount = (uint16)tmpRawCount;
    }

    #if(0u != CapSense_1_CSX_NOISE_METRIC_EN)
        tmpRegVal = CY_GET_REG32(CapSense_1_CSD_RESULT_VAL1_PTR) >> CapSense_1_CSD_RESULT_VAL1_BAD_CONVS_POS;

        if((tmpRegVal > CapSense_1_CSX_NOISE_METRIC_TH) && (CapSense_1_resamplingCyclesCnt > 0uL))
        {
            CY_SET_REG32(CapSense_1_CSD_SEQ_START_PTR, CapSense_1_SCAN_CSD_SEQ_START_CFG);
            CapSense_1_resamplingCyclesCnt--;
        }
        else
        {
            CapSense_1_CSXPostScanApiPtr();
            CapSense_1_resamplingCyclesCnt = CapSense_1_RESAMPLING_CYCLES_MAX_NUMBER;
        }
    #else
        CapSense_1_CSXPostScanApiPtr();
    #endif /* (0u != CapSense_1_CSX_NOISE_METRIC_EN) */

    if(CapSense_1_NOT_BUSY == (CapSense_1_dsRam.status & CapSense_1_SW_STS_BUSY))
    {
        CY_SET_REG32(CapSense_1_CSD_CONFIG_PTR, CapSense_1_DEFAULT_CSD_CONFIG_CFG);
        CY_SET_REG32(CapSense_1_CSD_CSDCMP_PTR, CapSense_1_DEFAULT_CSD_CSDCMP_CFG);
        CY_SET_REG32(CapSense_1_CSD_IDACA_PTR,  CapSense_1_DEFAULT_CSD_IDACA_CFG);
        CY_SET_REG32(CapSense_1_CSD_IO_SEL_PTR, CapSense_1_DEFAULT_CSD_SW_IO_SEL_CFG);
    }

    /* Enable interrupt */
    #if defined(CapSense_1_ISR__INTC_ASSIGNED)
        NVIC_EnableIRQ(CapSense_1_ISR_cfg.intrSrc);
    #endif
}
/** \}
* \endcond */

/*******************************************************************************
* Function Name: CapSense_1_SsCSXStartSampleExt
****************************************************************************//**
*
* \brief
*   Starts the HW sequencer to perform the CSX conversion.
*   specific widget.
*
* \details
*   This function covers the following functionality:
*      1. Configures the HW sequencer to perform the coarse initialization.
*      2. Waiting for completion of the coarse initialization.
*      3. Configures the HW sequencer to perform the normal conversion.
*      4. Starts the normal conversion
*
*******************************************************************************/
__STATIC_INLINE void CapSense_1_SsCSXStartSampleExt(void)
{
    uint32 filterDelay;
    uint32 watchdogCounter;
    #if (CapSense_1_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ)
        uint32 sampleClkFreqHz;
    #endif /* (CapSense_1_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ) */

    /* Configure the HW sequencer to perform the coarse initialization. */
    CY_SET_REG32(CapSense_1_CSD_CONFIG_PTR,           CapSense_1_DEFAULT_CSD_CONFIG_CFG);
    CY_SET_REG32(CapSense_1_CSD_HSCMP_PTR,            CapSense_1_PRECHARGE_CSD_HSCMP_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_HS_P_SEL_PTR,      CapSense_1_PRECHARGE_CSD_SW_HS_P_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_HS_N_SEL_PTR,      CapSense_1_PRECHARGE_CSD_SW_HS_N_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_DSI_SEL_PTR,       CapSense_1_PRECHARGE_CSD_SW_DSI_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_SHIELD_SEL_PTR,    CapSense_1_PRECHARGE_CSD_SW_SHIELD_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_FW_MOD_SEL_PTR,    CapSense_1_PRECHARGE_CSD_SW_FW_MOD_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_FW_TANK_SEL_PTR,   CapSense_1_PRECHARGE_CSD_SW_FW_TANK_SEL_CFG);

    CY_SET_REG32(CapSense_1_CSD_SW_RES_PTR,           CapSense_1_PRECHARGE_CSD_SW_RES_CFG);

    #if (CapSense_1_ENABLE == CapSense_1_BLOCK_OFF_AFTER_SCAN_EN)
        #if(CapSense_1_CSX_ANALOG_STARTUP_DELAY_US > 0uL)
            Cy_SysLib_DelayUs(CapSense_1_CSX_ANALOG_STARTUP_DELAY_US);
        #endif /* (CapSense_1_CSX_ANALOG_STARTUP_DELAY_US > 0uL) */
    #endif /* (CapSense_1_ENABLE == CapSense_1_BLOCK_OFF_AFTER_SCAN_EN) */

