swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_SensingCSX_LL.c
    CY_SET_REG32(CapSense_1_CSD_SEQ_START_PTR,        CapSense_1_PRECHARGE_CSD_SEQ_START_CFG);

    /* Wait for the HSCMP trigger and retutn the sequencer to the IDLE state. */
    watchdogCounter = CapSense_1_CSX_PRECHARGE_WATCHDOG_CYCLES_NUM;
    while((0u != (CapSense_1_CSD_SEQ_START_START_MSK & CY_GET_REG32(CapSense_1_CSD_SEQ_START_PTR))) && (0u != watchdogCounter))
    {
        watchdogCounter--;
    }

    /* Reset the sequencer to the IDLE state if HSCMP not triggered till watchdog period is out. */
    if(0u != (CapSense_1_CSD_SEQ_START_START_MSK & CY_GET_REG32(CapSense_1_CSD_SEQ_START_PTR)))
    {
        CY_SET_REG32(CapSense_1_CSD_SEQ_START_PTR,  CapSense_1_DEFAULT_CSD_SEQ_START_CFG);
    }

    #if (CapSense_1_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ)
        sampleClkFreqHz = CYDEV_CLK_PERICLK__HZ / (uint32)CapSense_1_dsRam.modCsxClk;
        if(sampleClkFreqHz <= CapSense_1_MOD_CSD_CLK_12MHZ)
        {
            filterDelay = CapSense_1_CSD_CONFIG_FILTER_DELAY_12MHZ;
        }
        else if(sampleClkFreqHz <= CapSense_1_MOD_CSD_CLK_24MHZ)
        {
            filterDelay = CapSense_1_CSD_CONFIG_FILTER_DELAY_24MHZ;
        }
        else
        {
            filterDelay = CapSense_1_CSD_CONFIG_FILTER_DELAY_48MHZ;
        }
    #else
        filterDelay = CapSense_1_CSD_CONFIG_FILTER_DELAY_12MHZ;
    #endif /* (CapSense_1_MOD_CSD_CLK_12MHZ < CYDEV_CLK_PERICLK__HZ) */

    /* Configure the HW sequencer to perform the normal conversion. */
    CY_SET_REG32(CapSense_1_CSD_CONFIG_PTR, CapSense_1_PRESCAN_CSD_CONFIG_CFG | filterDelay);
    CY_SET_REG32(CapSense_1_CSD_CSDCMP_PTR, CapSense_1_PRESCAN_CSD_CSDCMP_CFG);
    CY_SET_REG32(CapSense_1_CSD_HSCMP_PTR, CapSense_1_DEFAULT_CSD_HSCMP_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_HS_P_SEL_PTR, CapSense_1_DEFAULT_CSD_SW_HS_P_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_HS_N_SEL_PTR, CapSense_1_DEFAULT_CSD_SW_HS_N_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_DSI_SEL_PTR, CapSense_1_DEFAULT_CSD_SW_DSI_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_SHIELD_SEL_PTR, CapSense_1_DEFAULT_CSD_SW_SHIELD_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_FW_MOD_SEL_PTR, CapSense_1_DEFAULT_CSD_SW_FW_MOD_SEL_CFG);
    CY_SET_REG32(CapSense_1_CSD_SW_FW_TANK_SEL_PTR, CapSense_1_DEFAULT_CSD_SW_FW_TANK_SEL_CFG);

    CY_SET_REG32(CapSense_1_CSD_SW_RES_PTR, CapSense_1_SCAN_CSD_SW_RES_CFG);
    CY_SET_REG32(CapSense_1_CSD_IO_SEL_PTR, CapSense_1_SCAN_CSD_SW_IO_SEL_CFG);

    /* Clear all pending interrupts of CSD block */
    CY_SET_REG32(CapSense_1_CSD_INTR_PTR, CapSense_1_CSD_INTR_ALL_MSK);
    (void)CY_GET_REG32(CapSense_1_CSD_INTR_PTR);

    /* Start the normal conversion. */
    CY_SET_REG32(CapSense_1_CSD_SEQ_START_PTR, CapSense_1_SCAN_CSD_SEQ_START_CFG);
}

#if (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES)
/*******************************************************************************
* Function Name: CapSense_1_SsCSXOversample
****************************************************************************//**
*
* \brief
*   Calculates the scan period of specific node.
*
* \details
*   Calculates the scan period of specific node that is used as maximum
*   raw count at raw count inversion (CapSense_1_csxScanPeriod variable).
*   The CapSense_1_curFlashWdgtPtr and CapSense_1_curRamSnsPtr
*   must be configured to proper widget/sensor before calling this function.
*
* \return
*   Returns the scan period of specific node (used as maximum raw count)
*
*******************************************************************************/
static uint32 CapSense_1_SsCSXOversample(void)
{
    uint32 result;
    #if(CapSense_1_DISABLE == CapSense_1_CSX_COMMON_TX_CLK_EN)
        CapSense_1_RAM_WD_BASE_STRUCT * curRamWdgtBasePtr;
    #endif

    /* Find scan period */
    #if(CapSense_1_DISABLE == CapSense_1_CSX_COMMON_TX_CLK_EN)
        curRamWdgtBasePtr = (CapSense_1_RAM_WD_BASE_STRUCT *)CapSense_1_curFlashWdgtPtr->ptr2WdgtRam;
        result = ((uint32)CapSense_1_curRamSnsPtr->subConvNum *
            ((uint32)curRamWdgtBasePtr->snsClk - CapSense_1_CSX_DEADBAND_CYCLES_NUMBER));
    #else
        result = ((uint32)CapSense_1_curRamSnsPtr->subConvNum *
            ((uint32)CapSense_1_dsRam.snsCsxClk - CapSense_1_CSX_DEADBAND_CYCLES_NUMBER));
    #endif

    return result;
}
#endif /* (CapSense_1_ENABLE == CapSense_1_CSX_SKIP_OVSMPL_SPECIFIC_NODES) */

#endif  /* (0u != CapSense_1_CSX_EN) */


/* [] END OF FILE */
